# -*- ii: enabled; -*-
#+TITLE: Kind Cluster Setup
** TODO In a local OSC52 Compatible Terminal
   This needs to be run in an OSC52 compatible terminal like iTerm2, putty or
     xterm (libvte/gnome-terminals do not work)
   #+begin_src shell :eval nevel
     PODNAME=$(kubectl -n kubemacs get pod --selector=app=kubemacs -o name  | sed s:pod/::)
     kubectl exec -n kubemacs -t -i $PODNAME -- attach
   #+end_src

   #+RESULTS:
   #+begin_example
   #+end_example
